# IsWithFitting Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CableTrayType..::..IsWithFitting Property
CableTrayType Class See Also
---
Whether this cable tray type is with fitting
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsWithFitting { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsWithFitting As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsWithFitting {
	bool get ();
}
```

# Remarks
True if this cable tray type is with fitting type.
# See Also
CableTrayType Class
Autodesk.Revit.DB.Electrical Namespace